from joke import get_random_joke

def main(): # Функція main() є вхідною точкою програми.
    name = input("Будь ласка, введіть ваше ім'я: ") # спочатку запитує у користувача ім'я
    print(f"Привіт, {name}!") # потім вітає його

    while True:  # використовуючи нескінчений цикл while True
        user_response = input(f"{name}, бажаєте почути анекдот? (так/ні): ").lower() # програма запитує у користувача, чи хоче він почути анекдот
        if user_response == "так":  # Якщо користувач відповідає "так"
            print(get_random_joke()) # програма викликає get_random_joke() для отримання та виведення випадкового анекдоту
        elif user_response == "ні": # Якщо відповідь "ні"
            print(f"До побачення, {name}!") # програма виводить прощальне повідомлення
            break # виходить з циклу за допомогою оператора break, тим самим завершуючи виконання

if __name__ == "__main__": # Конструкція if __name__ == "__main__": перевіряє, чи запускається файл безпосередньо, а не імпортується як модуль
    main() # і тільки в цьому випадку викликає main()
